Simulations/Tests/Prueba_Malla/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
    (100 100 100) 			//Numer of cells in each direction
    simpleGrading (
        1					//x-dir grading
		(
			(20 30 100)		//y-dir grading: (length% cells% gradding_factor)
			(40 60 1)
			(20 30 0.001)
		) 
		(
			(20 30 100)		//z-dir grading: (length% cells% gradding_factor)
			(40 60 1)
			(20 30 0.001)
		) 
	)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (7 6 2 3)
            (0 1 5 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    top
    {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
